99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/usb_serial/esp32_mquickjs_usb_serial.c
#include "esp32_mquickjs_usb_serial.h"
#include "esp32_mquickjs_memory.h"

#if CONFIG_ESP32_MQUICKJS_FEATURE_USB_SERIAL

#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_event_queue.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_timer_resource.h"
#include "esp32_mquickjs_usb_serial_future_lifecycle.h"
#include "utils/esp32_mquickjs_byte_source.h"
#include "utils/esp32_mquickjs_line_framer.h"

#include <stdio.h>
#include <stdatomic.h>
#include <string.h>

#include "driver/usb_serial_jtag.h"
#include "driver/usb_serial_jtag_select.h"
#include "driver/usb_serial_jtag_vfs.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"

#define USB_SERIAL_READ_CHUNK_BYTES 256U
#define USB_SERIAL_JTAG_PACKET_BYTES 64U
#define USB_SERIAL_BINARY_WRITE_CHUNK_BYTES 256U
#define USB_SERIAL_BINARY_WRITE_STALL_TIMEOUT_MS 1000U
#define USB_SERIAL_EVENT_QUEUE_LEN \
    ((CONFIG_ESP32_MQUICKJS_USB_SERIAL_MAX_FRAME_BYTES + \
      USB_SERIAL_JTAG_PACKET_BYTES - 1U) / USB_SERIAL_JTAG_PACKET_BYTES)

typedef struct {
    uint8_t *data;
    size_t length;
    bool overflow;
} esp32_mquickjs_usb_serial_event_t;

typedef struct {
    uint32_t generation;
} esp32_mquickjs_usb_serial_ref_t;

typedef struct {
    bool initialized;
    bool opened;
    bool polling;
    bool release_buffer;
    bool binary;
    uint32_t generation;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_event_queue_t *event_queue;
    char *line_buffer;
    size_t max_frame_bytes;
    esp32_mquickjs_line_framer_t framer;
    uint32_t received_frames;
    uint32_t sent_frames;
    uint32_t overflow_frames;
    bool sending;
} esp32_mquickjs_usb_serial_state_t;

typedef struct {
    bool handled;
} esp32_mquickjs_usb_serial_emit_context_t;

static esp32_mquickjs_usb_serial_state_t s_usb_serial_state;
static _Atomic uint32_t s_usb_serial_next_generation = 1;
static esp32_mquickjs_usb_serial_ref_t s_usb_serial_closed_ref;

/*
 * The USB Serial/JTAG VFS console and interrupt-driven driver are physical
 * boot resources. A JavaScript runtime restart must close only the JS-owned
 * stream and event queue; uninstalling and reinstalling the driver here can
 * make the host re-enumerate the USB device and, on ESP32-S3, turn a
 * restartRuntime() into a USB_UART_CHIP_RESET. Keep the driver installed for
 * the lifetime of the firmware boot.
 */
static bool s_usb_serial_driver_ready;

static bool usb_serial_poller(JSContext *ctx,
                              esp32_mquickjs_runtime_t *runtime,
                              void *opaque);
static bool usb_serial_register_future_driver(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime);
static void usb_serial_future_timeout_wake(void *opaque);

typedef enum {
    USB_SERIAL_WRITE_OK = 0,
    USB_SERIAL_WRITE_DISCONNECTED,
    USB_SERIAL_WRITE_CLOSED,
    USB_SERIAL_WRITE_TIMEOUT,
    USB_SERIAL_WRITE_INTERRUPTED,
} esp32_mquickjs_usb_serial_write_result_t;

static esp32_mquickjs_usb_serial_write_result_t usb_serial_write_binary(
    JSContext *ctx,
    const uint8_t *data,
    size_t length)
{
    esp32_mquickjs_runtime_t *runtime = esp32_mquickjs_get_active_runtime();
    uint64_t progress_deadline_us =
        (uint64_t)esp_timer_get_time() +
        ((uint64_t)USB_SERIAL_BINARY_WRITE_STALL_TIMEOUT_MS * 1000ULL);
    size_t offset = 0;

    while (offset < length) {
        size_t chunk = length - offset;
        uint64_t now_us;
        uint64_t remaining_us;
        uint32_t wait_ms;
        esp32_mquickjs_poll_result_t poll_result;
        int written;

        if (!s_usb_serial_state.initialized || !s_usb_serial_state.opened) {
            return USB_SERIAL_WRITE_CLOSED;
        }
        if (!usb_serial_jtag_is_connected()) {
            return USB_SERIAL_WRITE_DISCONNECTED;
        }
        if (chunk > USB_SERIAL_BINARY_WRITE_CHUNK_BYTES) {
            chunk = USB_SERIAL_BINARY_WRITE_CHUNK_BYTES;
        }
        written = usb_serial_jtag_write_bytes(
            data + offset,
            chunk,
            0);
        if (written > 0) {
            offset += (size_t)written;
            progress_deadline_us =
                (uint64_t)esp_timer_get_time() +
                ((uint64_t)USB_SERIAL_BINARY_WRITE_STALL_TIMEOUT_MS * 1000ULL);
            continue;
        }

        poll_result = esp32_mquickjs_poll(ctx, runtime);
        if (!esp32_mquickjs_cooperate(runtime)) {
            return USB_SERIAL_WRITE_INTERRUPTED;
        }
        now_us = (uint64_t)esp_timer_get_time();
        if (now_us >= progress_deadline_us) {
            return USB_SERIAL_WRITE_TIMEOUT;
        }
        if (poll_result != ESP32_MQUICKJS_POLL_NONE) {
            continue;
        }
        remaining_us = progress_deadline_us - now_us;
        wait_ms = (uint32_t)((remaining_us + 999ULL) / 1000ULL);
        (void)esp32_mquickjs_wait_for_activity(runtime, wait_ms);
        if (!esp32_mquickjs_cooperate(runtime)) {
            return USB_SERIAL_WRITE_INTERRUPTED;
        }
    }
    return USB_SERIAL_WRITE_OK;
}

static JSValue usb_serial_write_error(
    JSContext *ctx,
    esp32_mquickjs_usb_serial_write_result_t result)
{
    switch (result) {
    case USB_SERIAL_WRITE_DISCONNECTED:
        return JS_ThrowReferenceError(
            ctx, "usbSerial.send() failed because USB Serial/JTAG is not connected");
    case USB_SERIAL_WRITE_CLOSED:
        return JS_ThrowReferenceError(
            ctx, "usbSerial.send() was interrupted because the transport was closed");
    case USB_SERIAL_WRITE_TIMEOUT:
        return JS_ThrowInternalError(
            ctx, "usbSerial.send() timed out waiting for USB transmit capacity");
    case USB_SERIAL_WRITE_INTERRUPTED:
        return JS_ThrowInternalError(
            ctx, "usbSerial.send() was interrupted by a runtime stop request");
    case USB_SERIAL_WRITE_OK:
    default:
        return JS_ThrowInternalError(ctx, "usbSerial.send() failed");
    }
}

static void usb_serial_notify_from_isr(usj_select_notif_t notification,
                                       int *task_woken)
{
    if ((notification == USJ_SELECT_READ_NOTIF ||
         notification == USJ_SELECT_WRITE_NOTIF ||
         notification == USJ_SELECT_ERROR_NOTIF) &&
        s_usb_serial_state.initialized && s_usb_serial_state.opened) {
        esp32_mquickjs_notify_active_runtime_from_isr(task_woken);
    }
}

