99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/usb_serial/esp32_mquickjs_usb_serial.c
static void usb_serial_release_line_buffer(void)
{
    esp32_mquickjs_memory_payload_free(s_usb_serial_state.line_buffer);
    s_usb_serial_state.line_buffer = NULL;
    s_usb_serial_state.release_buffer = false;
    esp32_mquickjs_line_framer_init(&s_usb_serial_state.framer, NULL, 0);
}

static void usb_serial_close_source(void *opaque)
{
    (void)opaque;
    s_usb_serial_state.event_queue = NULL;
    s_usb_serial_state.opened = false;
    if (s_usb_serial_state.polling) {
        s_usb_serial_state.release_buffer = true;
    } else {
        usb_serial_release_line_buffer();
    }
}

static void usb_serial_close_internal(void)
{
    esp32_mquickjs_event_queue_t *event_queue = s_usb_serial_state.event_queue;

    if (event_queue != NULL) {
        (void)esp32_mquickjs_event_queue_close(event_queue);
    } else {
        usb_serial_close_source(NULL);
    }
}

static void usb_serial_drop_event(void *data, void *opaque)
{
    esp32_mquickjs_usb_serial_event_t *event = data;

    (void)opaque;
    if (event != NULL) {
        esp32_mquickjs_memory_payload_free(event->data);
        event->data = NULL;
    }
}

static JSValue usb_serial_event_to_js(JSContext *ctx, const void *data, void *opaque)
{
    esp32_mquickjs_usb_serial_event_t *event = (esp32_mquickjs_usb_serial_event_t *)data;
    JSValue result;

    (void)opaque;
    if (event->overflow) {
        return JS_ThrowRangeError(ctx, "serial frame exceeds configured maxFrameBytes");
    }
    if (s_usb_serial_state.binary) {
        result = esp32_mquickjs_new_owned_byte_view(ctx, event->data, event->length);
        event->data = NULL;
    } else {
        result = JS_NewStringLen(ctx,
                                 event->data != NULL ? (const char *)event->data : "",
                                 event->length);
        esp32_mquickjs_memory_payload_free(event->data);
        event->data = NULL;
    }
    return result;
}

static void usb_serial_emit_frame(void *opaque,
                                  const char *frame,
                                  size_t frame_len,
                                  bool overflow)
{
    esp32_mquickjs_usb_serial_emit_context_t *emit = opaque;
    esp32_mquickjs_usb_serial_event_t event = {
        .length = frame_len,
        .overflow = overflow,
    };

    if (emit == NULL || s_usb_serial_state.event_queue == NULL) {
        return;
    }
    if (overflow) {
        s_usb_serial_state.overflow_frames++;
        emit->handled = esp32_mquickjs_event_queue_send(s_usb_serial_state.event_queue,
                                                       &event) || emit->handled;
        return;
    }

    if (frame_len > 0) {
        event.data = esp32_mquickjs_memory_payload_alloc(
            "usb-serial.rx-event", frame_len,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (event.data == NULL) {
            s_usb_serial_state.overflow_frames++;
            return;
        }
        memcpy(event.data, frame, frame_len);
    }
    s_usb_serial_state.received_frames++;
    if (!esp32_mquickjs_event_queue_send(s_usb_serial_state.event_queue, &event)) {
        esp32_mquickjs_memory_payload_free(event.data);
    } else {
        emit->handled = true;
    }
}

static bool usb_serial_poller(JSContext *ctx,
                              esp32_mquickjs_runtime_t *runtime,
                              void *opaque)
{
    esp32_mquickjs_usb_serial_emit_context_t emit = {0};
    uint8_t chunk[USB_SERIAL_READ_CHUNK_BYTES];
    int read_len;

    (void)opaque;
    (void)ctx;
    (void)runtime;
    if (!s_usb_serial_state.initialized || !s_usb_serial_state.opened ||
        (!s_usb_serial_state.binary && s_usb_serial_state.line_buffer == NULL)) {
        return false;
    }

    s_usb_serial_state.polling = true;
    do {
        read_len = usb_serial_jtag_read_bytes(chunk, sizeof(chunk), 0);
        if (read_len > 0) {
            if (s_usb_serial_state.binary) {
                usb_serial_emit_frame(&emit,
                                      (const char *)chunk,
                                      (size_t)read_len,
                                      false);
            } else {
                esp32_mquickjs_line_framer_feed(&s_usb_serial_state.framer,
                                                chunk,
                                                (size_t)read_len,
                                                usb_serial_emit_frame,
                                                &emit);
            }
        }
    } while (read_len > 0 && s_usb_serial_state.opened);
    s_usb_serial_state.polling = false;

    if (s_usb_serial_state.release_buffer) {
        usb_serial_release_line_buffer();
    }
    return emit.handled;
}

static bool usb_serial_parse_frame_limit(JSContext *ctx,
                                         JSValue options,
                                         bool binary,
                                         size_t *out_max_frame_bytes)
{
    JSValue value;
    int raw_value;
    int minimum = binary ? (int)USB_SERIAL_JTAG_PACKET_BYTES : 256;
    const char *name = binary ? "chunkBytes" : "maxFrameBytes";

    *out_max_frame_bytes = CONFIG_ESP32_MQUICKJS_USB_SERIAL_MAX_FRAME_BYTES;
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    if (JS_GetClassID(ctx, options) < 0) {
        return false;
    }

    value = JS_GetPropertyStr(ctx, options, name);
    if (JS_IsUndefined(value)) {
        return true;
    }
    if (JS_ToInt32(ctx, &raw_value, value) != 0 || raw_value < minimum ||
        raw_value > CONFIG_ESP32_MQUICKJS_USB_SERIAL_MAX_FRAME_BYTES) {
        return false;
    }
    *out_max_frame_bytes = (size_t)raw_value;
    return true;
}

static bool usb_serial_parse_binary_mode(JSContext *ctx,
                                         JSValue options,
                                         bool *out_binary)
{
    JSGCRef value_ref;
    JSValue *value;
    JSCStringBuf mode_buf;
    const char *mode;

    *out_binary = false;
    if (JS_IsUndefined(options) || JS_IsNull(options)) {
        return true;
    }
    value = JS_PushGCRef(ctx, &value_ref);
    *value = JS_GetPropertyStr(ctx, options, "mode");
    if (JS_IsException(*value)) {
        JS_PopGCRef(ctx, &value_ref);
        return false;
    }
    if (JS_IsUndefined(*value)) {
        JS_PopGCRef(ctx, &value_ref);
        return true;
    }
    if (!JS_IsString(ctx, *value)) {
        JS_PopGCRef(ctx, &value_ref);
        return false;
    }
    mode = JS_ToCString(ctx, *value, &mode_buf);
    if (mode == NULL || (strcmp(mode, "text") != 0 && strcmp(mode, "binary") != 0)) {
        JS_PopGCRef(ctx, &value_ref);
        return false;
    }
    *out_binary = strcmp(mode, "binary") == 0;
    JS_PopGCRef(ctx, &value_ref);
    return true;
}

bool esp32_mquickjs_init_usb_serial_runtime(JSContext *ctx,
                                             esp32_mquickjs_runtime_t *runtime)
{
    usb_serial_jtag_driver_config_t config = USB_SERIAL_JTAG_DRIVER_CONFIG_DEFAULT();
    esp_err_t err;

    if (s_usb_serial_state.initialized) {
        s_usb_serial_state.runtime = runtime;
        return true;
    }

    memset(&s_usb_serial_state, 0, sizeof(s_usb_serial_state));
    s_usb_serial_state.runtime = runtime;
    if (!s_usb_serial_driver_ready || !usb_serial_jtag_is_driver_installed()) {
        if (!usb_serial_jtag_is_driver_installed()) {
            config.rx_buffer_size = CONFIG_ESP32_MQUICKJS_USB_SERIAL_RX_BUFFER_SIZE;
            config.tx_buffer_size = CONFIG_ESP32_MQUICKJS_USB_SERIAL_TX_BUFFER_SIZE;
            err = usb_serial_jtag_driver_install(&config);
            if (err != ESP_OK) {
                JS_ThrowInternalError(ctx,
                                      "failed to install USB serial driver: %s",
                                      esp_err_to_name(err));
                return false;
            }
        }
        usb_serial_jtag_vfs_use_driver();
        setvbuf(stdin, NULL, _IONBF, 0);
        setvbuf(stdout, NULL, _IONBF, 0);
        s_usb_serial_driver_ready = true;
    } else {
        /* Reattach the retained physical console to the new generation. */
        usb_serial_jtag_vfs_use_driver();
    }

    usb_serial_jtag_set_select_notif_callback(usb_serial_notify_from_isr);
    if (!esp32_mquickjs_register_async_poller(runtime, usb_serial_poller, NULL)) {
        usb_serial_jtag_set_select_notif_callback(NULL);
        memset(&s_usb_serial_state, 0, sizeof(s_usb_serial_state));
        JS_ThrowInternalError(ctx, "failed to register USB serial poller");
        return false;
    }

    s_usb_serial_state.initialized = true;
    if (!usb_serial_register_future_driver(ctx, runtime)) {
        usb_serial_jtag_set_select_notif_callback(NULL);
        memset(&s_usb_serial_state, 0, sizeof(s_usb_serial_state));
        return false;
    }
    return true;
}

void esp32_mquickjs_deinit_usb_serial_runtime(JSContext *ctx)
{
    (void)ctx;
    if (!s_usb_serial_state.initialized) {
        return;
    }

    /* Close generation-owned JS state only. The physical driver, VFS mode,
     * and USB connection stay up across restartRuntime(). */
    usb_serial_close_internal();
    usb_serial_jtag_set_select_notif_callback(NULL);
    memset(&s_usb_serial_state, 0, sizeof(s_usb_serial_state));
}

static uint32_t usb_serial_next_generation(void)
{
    uint32_t generation = atomic_fetch_add_explicit(
        &s_usb_serial_next_generation, 1, memory_order_relaxed);

    if (generation == 0) {
        generation = atomic_fetch_add_explicit(
            &s_usb_serial_next_generation, 1, memory_order_relaxed);
    }
    return generation;
}

static esp32_mquickjs_usb_serial_ref_t *usb_serial_ref_from_value(
    JSContext *ctx, JSValue value, bool require_open)
{
    esp32_mquickjs_usb_serial_ref_t *ref;

    if (JS_GetClassID(ctx, value) != JS_CLASS_USB_SERIAL_HANDLE ||
        (ref = JS_GetOpaque(ctx, value)) == NULL ||
        ref == &s_usb_serial_closed_ref) {
        JS_ThrowTypeError(ctx, "expected a USBSerialHandle");
        return NULL;
    }
    if (require_open &&
        (!s_usb_serial_state.opened ||
         ref->generation != s_usb_serial_state.generation)) {
        JS_ThrowReferenceError(ctx, "USB_SERIAL_STALE_HANDLE: handle is closed");
        return NULL;
    }
    return ref;
}

JSValue js_usb_serial_handle_constructor(JSContext *ctx, JSValue *this_val,
                                         int argc, JSValue *argv)
{
    (void)this_val;
    (void)argc;
    (void)argv;
    return JS_ThrowTypeError(ctx,
                             "USBSerialHandle cannot be constructed directly");
}

void js_usb_serial_handle_finalizer(JSContext *ctx, void *opaque)
{
    esp32_mquickjs_usb_serial_ref_t *ref = opaque;

    (void)ctx;
    if (ref != NULL && ref != &s_usb_serial_closed_ref) {
        if (s_usb_serial_state.opened &&
            ref->generation == s_usb_serial_state.generation) {
            esp32_mquickjs_event_queue_request_close(
                s_usb_serial_state.event_queue);
        }
        heap_caps_free(ref);
    }
}

JSValue js_usb_serial_receive(JSContext *ctx, JSValue *this_val,
                              int argc, JSValue *argv)
{
    JSGCRef receiver_ref, method_ref;
    JSValue *receiver = JS_PushGCRef(ctx, &receiver_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    JSValue result;

    if (this_val == NULL ||
        usb_serial_ref_from_value(ctx, *this_val, true) == NULL) {
        JS_PopGCRef(ctx, &method_ref);
        JS_PopGCRef(ctx, &receiver_ref);
        return JS_EXCEPTION;
    }
    *receiver = *this_val;
    *method = JS_GetPropertyStr(ctx, *receiver, "receive");
    result = JS_IsException(*method)
                 ? JS_EXCEPTION
                 : esp32_mquickjs_future_call_and_wait(
                       ctx, esp32_mquickjs_get_active_runtime(), *method,
                       *receiver, argc, argv);
    JS_PopGCRef(ctx, &method_ref);
    JS_PopGCRef(ctx, &receiver_ref);
    return result;
}

JSValue js_usb_serial_stats(JSContext *ctx, JSValue *this_val,
                            int argc, JSValue *argv)
{
    if (this_val == NULL ||
        usb_serial_ref_from_value(ctx, *this_val, true) == NULL) {
        return JS_EXCEPTION;
    }
    return js_event_queue_stats(ctx, this_val, argc, argv);
}

