99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/usb_serial/esp32_mquickjs_usb_serial.c
JSValue js_usb_serial_capabilities(JSContext *ctx, JSValue *this_val,
                                   int argc, JSValue *argv)
{
    JSGCRef result_ref, modes_ref;
    JSValue *result = JS_PushGCRef(ctx, &result_ref);
    JSValue *modes = JS_PushGCRef(ctx, &modes_ref);

    (void)this_val;
    (void)argv;
    if (argc != 0) {
        JS_PopGCRef(ctx, &modes_ref);
        JS_PopGCRef(ctx, &result_ref);
        return JS_ThrowTypeError(ctx,
                                 "usbSerial.capabilities() expects no arguments");
    }
    *result = JS_NewObject(ctx);
    *modes = JS_NewArray(ctx, 2);
    if (!JS_IsException(*modes)) {
        (void)JS_SetPropertyUint32(ctx, *modes, 0,
                                   JS_NewString(ctx, "text"));
        (void)JS_SetPropertyUint32(ctx, *modes, 1,
                                   JS_NewString(ctx, "binary"));
    }
    if (JS_IsException(*result) || JS_IsException(*modes) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "apiVersion",
                                         JS_NewString(ctx, "v1")) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "target",
                                         JS_NewString(ctx, CONFIG_IDF_TARGET)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "idfVersion",
                                         JS_NewString(ctx, IDF_VER)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "supported", JS_TRUE) ||
        !esp32_mquickjs_set_property_ref(
            ctx, result, "maxFrameBytes",
            JS_NewUint32(ctx,
                         CONFIG_ESP32_MQUICKJS_USB_SERIAL_MAX_FRAME_BYTES)) ||
        !esp32_mquickjs_set_property_ref(ctx, result, "modes", *modes)) {
        *result = JS_EXCEPTION;
    }
    JS_PopGCRef(ctx, &modes_ref);
    return JS_PopGCRef(ctx, &result_ref);
}

JSValue js_usb_serial_open(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    JSValue options = JS_UNDEFINED;
    static const char *const allowed[] = {
        "mode", "maxFrameBytes", "chunkBytes",
    };
    JSGCRef queue_ref;
    JSGCRef handle_ref;
    JSValue *queue_object;
    JSValue *handle;
    JSValue return_value;
    esp32_mquickjs_usb_serial_ref_t *ref = NULL;
    size_t max_frame_bytes;
    bool binary;

    (void)this_val;
    if (!s_usb_serial_state.initialized) {
        return JS_ThrowInternalError(ctx, "usbSerial is not initialized");
    }
    if (s_usb_serial_state.opened || s_usb_serial_state.polling) {
        return JS_ThrowInternalError(ctx, "usbSerial is already open");
    }
    if (argc > 1) {
        return JS_ThrowTypeError(ctx, "usbSerial.open(options?) expects at most one options object");
    }
    if (argc == 1) {
        options = argv[0];
    }
    if (!JS_IsUndefined(options) &&
        !esp32_mquickjs_validate_plain_options(
            ctx, options, "usbSerial.open()", allowed,
            sizeof(allowed) / sizeof(allowed[0]))) {
        return JS_EXCEPTION;
    }
    if (!usb_serial_parse_binary_mode(ctx, options, &binary)) {
        return JS_ThrowTypeError(ctx,
                                 "usbSerial.open() mode must be \"text\" or \"binary\"");
    }
    if (!usb_serial_parse_frame_limit(ctx, options, binary,
                                      &max_frame_bytes)) {
        return JS_ThrowRangeError(
            ctx,
            binary
                ? "usbSerial.open() chunkBytes must be between 64 and %d"
                : "usbSerial.open() maxFrameBytes must be between 256 and %d",
            CONFIG_ESP32_MQUICKJS_USB_SERIAL_MAX_FRAME_BYTES);
    }

    if (!binary) {
        s_usb_serial_state.line_buffer =
            esp32_mquickjs_memory_payload_alloc(
                "usb-serial.line-buffer", max_frame_bytes,
                ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (s_usb_serial_state.line_buffer == NULL) {
            return JS_ThrowOutOfMemory(ctx);
        }
    }
    s_usb_serial_state.binary = binary;
    s_usb_serial_state.max_frame_bytes = max_frame_bytes;
    esp32_mquickjs_line_framer_init(&s_usb_serial_state.framer,
                                    s_usb_serial_state.line_buffer,
                                    max_frame_bytes);
    queue_object = JS_PushGCRef(ctx, &queue_ref);
    handle = JS_PushGCRef(ctx, &handle_ref);
    *queue_object = esp32_mquickjs_event_queue_new(
        ctx,
        s_usb_serial_state.runtime,
        sizeof(esp32_mquickjs_usb_serial_event_t),
        USB_SERIAL_EVENT_QUEUE_LEN,
        ESP32_MQUICKJS_EVENT_QUEUE_DROP_NEWEST,
        usb_serial_event_to_js,
        usb_serial_drop_event,
        usb_serial_close_source,
        NULL);
    *handle = JS_NewObjectClassUser(ctx, JS_CLASS_USB_SERIAL_HANDLE);
    if (!JS_IsException(*handle)) {
        ref = heap_caps_calloc(1, sizeof(*ref), MALLOC_CAP_8BIT);
        if (ref == NULL) {
            JS_ThrowOutOfMemory(ctx);
            *handle = JS_EXCEPTION;
        } else {
            ref->generation = usb_serial_next_generation();
            JS_SetOpaque(ctx, *handle, ref);
        }
    }
    if (JS_IsException(*queue_object) || JS_IsException(*handle) ||
        !esp32_mquickjs_set_property_ref(ctx, handle, "_eventQueue",
                                         *queue_object)) {
        if (ref != NULL) {
            JS_SetOpaque(ctx, *handle, NULL);
            heap_caps_free(ref);
        }
        usb_serial_release_line_buffer();
        JS_PopGCRef(ctx, &handle_ref);
        JS_PopGCRef(ctx, &queue_ref);
        return JS_EXCEPTION;
    }
    s_usb_serial_state.event_queue = JS_GetOpaque(ctx, *queue_object);
    s_usb_serial_state.generation = ref->generation;
    s_usb_serial_state.opened = true;
    return_value = JS_PopGCRef(ctx, &handle_ref);
    JS_PopGCRef(ctx, &queue_ref);
    return return_value;
}

JSValue js_usb_serial_close(JSContext *ctx,
                            JSValue *this_val,
                            int argc,
                            JSValue *argv)
{
    esp32_mquickjs_usb_serial_ref_t *ref;
    bool was_open;

    if (this_val == NULL || argc != 0 ||
        JS_GetClassID(ctx, *this_val) != JS_CLASS_USB_SERIAL_HANDLE) {
        return JS_ThrowTypeError(ctx,
                                 "USBSerialHandle.close() expects no arguments");
    }
    (void)argv;
    ref = JS_GetOpaque(ctx, *this_val);
    if (ref == NULL || ref == &s_usb_serial_closed_ref) {
        return JS_FALSE;
    }
    was_open = s_usb_serial_state.opened &&
               ref->generation == s_usb_serial_state.generation;
    if (was_open) usb_serial_close_internal();
    JS_SetOpaque(ctx, *this_val, &s_usb_serial_closed_ref);
    heap_caps_free(ref);
    return JS_NewBool(was_open);
}

JSValue js_usb_serial_send(JSContext *ctx,
                           JSValue *this_val,
                           int argc,
                           JSValue *argv)
{
    esp32_mquickjs_usb_serial_write_result_t write_result = USB_SERIAL_WRITE_OK;
    JSCStringBuf text_buf;
    const char *text;
    size_t text_len = 0;

    if (this_val == NULL ||
        usb_serial_ref_from_value(ctx, *this_val, true) == NULL || argc != 1) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(ctx, "usbSerial.send(data) expects an open transport and data");
    }
    if (s_usb_serial_state.sending) {
        return JS_ThrowInternalError(ctx, "usbSerial.send() failed because another send is active");
    }
    if (!usb_serial_jtag_is_connected()) {
        return JS_ThrowReferenceError(
            ctx, "usbSerial.send() failed because USB Serial/JTAG is not connected");
    }
    if (s_usb_serial_state.binary) {
        int class_id = JS_GetClassID(ctx, argv[0]);

        if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
            class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
            esp32_mquickjs_byte_span_source_t source;
            JSValue error = JS_UNDEFINED;
            size_t total = 0;

            if (!esp32_mquickjs_open_byte_span_source(ctx, argv[0],
                                                      "usbSerial.send(data)",
                                                      &source, &error)) {
                return JS_IsUndefined(error) ? JS_EXCEPTION : error;
            }
            s_usb_serial_state.sending = true;
            flockfile(stdout);
            while (true) {
                esp32_mquickjs_byte_span_t span;

                if (!esp32_mquickjs_byte_span_source_next(ctx, &source, &span)) {
                    break;
                }
                if (span.length == 0) {
                    continue;
                }
                if (span.data == NULL) {
                    JS_ThrowInternalError(
                        ctx,
                        "usbSerial.send(data) received a non-empty span with null data");
                    break;
                }
                write_result = usb_serial_write_binary(
                    ctx, span.data, span.length);
                if (write_result != USB_SERIAL_WRITE_OK) {
                    break;
                }
                total += span.length;
            }
            esp32_mquickjs_byte_span_source_close(ctx, &source);
            funlockfile(stdout);
            s_usb_serial_state.sending = false;
            if (JS_HasException(ctx)) {
                return JS_EXCEPTION;
            }
            if (write_result != USB_SERIAL_WRITE_OK) {
                return usb_serial_write_error(ctx, write_result);
            }
            s_usb_serial_state.sent_frames++;
            return JS_NewInt64(ctx, (int64_t)total);
        } else {
            esp32_mquickjs_byte_source_t source;
            uint8_t *owned = NULL;
            JSValue error = JS_UNDEFINED;
            bool leased = false;

