99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/usb_serial/esp32_mquickjs_usb_serial.c
            if (class_id == JS_CLASS_BYTE_VIEW) {
                if (!esp32_mquickjs_byte_view_acquire_read(
                        ctx, argv[0], "usbSerial.send(data)",
                        &source.data, &source.length)) {
                    return JS_EXCEPTION;
                }
                source.owner = argv[0];
                leased = true;
            } else if (!esp32_mquickjs_get_byte_source(ctx, argv[0],
                                                       "usbSerial.send(data)",
                                                       &source, &owned, &error)) {
                return JS_IsUndefined(error) ? JS_EXCEPTION : error;
            }
            s_usb_serial_state.sending = true;
            flockfile(stdout);
            write_result = usb_serial_write_binary(ctx, source.data, source.length);
            funlockfile(stdout);
            s_usb_serial_state.sending = false;
            if (leased) {
                esp32_mquickjs_byte_view_release_read(ctx, argv[0]);
            }
            esp32_mquickjs_release_byte_source(owned);
            if (write_result != USB_SERIAL_WRITE_OK) {
                return usb_serial_write_error(ctx, write_result);
            }
            s_usb_serial_state.sent_frames++;
            return JS_NewInt64(ctx, (int64_t)source.length);
        }
    }
    if (!JS_IsString(ctx, argv[0])) {
        return JS_ThrowTypeError(ctx, "usbSerial.send(text) expects a string in text mode");
    }
    text = JS_ToCStringLen(ctx, &text_len, argv[0], &text_buf);
    if (text == NULL) {
        return JS_EXCEPTION;
    }
    if (text_len > s_usb_serial_state.max_frame_bytes) {
        return JS_ThrowRangeError(ctx, "usbSerial.send() frame is too large");
    }
    if (memchr(text, '\n', text_len) != NULL || memchr(text, '\r', text_len) != NULL) {
        return JS_ThrowTypeError(ctx, "usbSerial.send() text must contain exactly one line");
    }

    {
        uint8_t *frame = esp32_mquickjs_memory_payload_alloc(
            "usb-serial.tx-frame", text_len + 1U,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);

        if (frame == NULL) {
            return JS_ThrowOutOfMemory(ctx);
        }
        memcpy(frame, text, text_len);
        frame[text_len] = '\n';
        s_usb_serial_state.sending = true;
        flockfile(stdout);
        write_result = usb_serial_write_binary(ctx, frame, text_len + 1U);
        funlockfile(stdout);
        s_usb_serial_state.sending = false;
        esp32_mquickjs_memory_payload_free(frame);
    }
    if (write_result != USB_SERIAL_WRITE_OK) {
        return usb_serial_write_error(ctx, write_result);
    }
    s_usb_serial_state.sent_frames++;
    return JS_NewInt64(ctx, (int64_t)text_len);
}

typedef enum {
    USB_SERIAL_FUTURE_FIXED,
    USB_SERIAL_FUTURE_SPANS,
} usb_serial_future_source_kind_t;

struct esp32_mquickjs_future_driver_state {
    JSContext *ctx;
    esp32_mquickjs_runtime_t *runtime;
    esp32_mquickjs_future_token_t token;
    usb_serial_future_source_kind_t source_kind;
    esp32_mquickjs_byte_span_source_t span_source;
    esp32_mquickjs_byte_span_t span;
    JSGCRef value_ref;
    const uint8_t *data;
    uint8_t *owned;
    size_t length;
    size_t offset;
    size_t logical_length;
    size_t bytes_sent;
    uint32_t generation;
    uint64_t progress_deadline_us;
    uint64_t progress_timer_delay_us;
    esp32_mquickjs_timer_resource_t progress_timer;
    esp32_mquickjs_usb_serial_write_result_t result;
    esp32_mquickjs_usb_serial_future_lifecycle_t lifecycle;
    bool value_retained;
    bool byte_view_leased;
    bool span_source_opened;
    bool source_failed;
};

static int usb_serial_future_progress_timer_create(
    void *opaque, void **out_timer)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;
    esp_timer_create_args_t timer_args = {
        .callback = usb_serial_future_timeout_wake,
        .arg = state,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "usb_tx_stall",
        .skip_unhandled_events = true,
    };
    esp_timer_handle_t timer = NULL;
    esp_err_t err;

    if (state == NULL || out_timer == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    err = esp_timer_create(&timer_args, &timer);
    *out_timer = timer;
    return err;
}

static int usb_serial_future_progress_timer_start(void *timer, void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state == NULL || state->progress_timer_delay_us == 0) {
        return ESP_ERR_INVALID_ARG;
    }
    return esp_timer_start_once((esp_timer_handle_t)timer,
                                state->progress_timer_delay_us);
}

static void usb_serial_future_progress_timer_stop(void *timer, void *opaque)
{
    (void)opaque;
    (void)esp_timer_stop((esp_timer_handle_t)timer);
}

static void usb_serial_future_progress_timer_delete(void *timer, void *opaque)
{
    (void)opaque;
    (void)esp_timer_delete((esp_timer_handle_t)timer);
}

static esp32_mquickjs_timer_resource_ops_t
usb_serial_future_progress_timer_ops(
    esp32_mquickjs_future_driver_state_t *state)
{
    return (esp32_mquickjs_timer_resource_ops_t){
        .create = usb_serial_future_progress_timer_create,
        .start = usb_serial_future_progress_timer_start,
        .stop = usb_serial_future_progress_timer_stop,
        .delete_timer = usb_serial_future_progress_timer_delete,
        .opaque = state,
    };
}

static void usb_serial_future_release(
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_timer_resource_ops_t timer_ops;

    if (state == NULL) {
        return;
    }
    timer_ops = usb_serial_future_progress_timer_ops(state);
    esp32_mquickjs_timer_resource_deinit(&state->progress_timer,
                                         &timer_ops);
    if (state->span_source_opened) {
        esp32_mquickjs_byte_span_source_close(state->ctx,
                                               &state->span_source);
        state->span_source_opened = false;
    }
    if (state->byte_view_leased && state->value_retained) {
        esp32_mquickjs_byte_view_release_read(state->ctx,
                                              state->value_ref.val);
        state->byte_view_leased = false;
    }
    if (state->value_retained) {
        JS_DeleteGCRef(state->ctx, &state->value_ref);
        state->value_retained = false;
    }
    esp32_mquickjs_memory_payload_free(state->owned);
    heap_caps_free(state);
}

