99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/usb_serial/esp32_mquickjs_usb_serial.c
static bool usb_serial_future_prepare(
    JSContext *ctx,
    JSGCRef *this_ref,
    int argc,
    JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **out_state)
{
    esp32_mquickjs_future_driver_state_t *state;
    JSValue error = JS_UNDEFINED;

    if (out_state == NULL || argc != 1 ||
        !s_usb_serial_state.initialized || !s_usb_serial_state.opened ||
        this_ref == NULL ||
        usb_serial_ref_from_value(ctx, this_ref->val, true) == NULL) {
        if (JS_HasException(ctx)) return false;
        JS_ThrowTypeError(
            ctx,
            "usbSerial.send(data) expects an open transport and one data argument");
        return false;
    }
    if (!usb_serial_jtag_is_connected()) {
        JS_ThrowReferenceError(
            ctx,
            "usbSerial.send() failed because USB Serial/JTAG is not connected");
        return false;
    }
    state = heap_caps_calloc(1, sizeof(*state), MALLOC_CAP_8BIT);
    if (state == NULL) {
        JS_ThrowOutOfMemory(ctx);
        return false;
    }
    state->ctx = ctx;
    state->generation = s_usb_serial_state.generation;
    state->result = USB_SERIAL_WRITE_OK;
    esp32_mquickjs_byte_span_clear(&state->span);

    if (s_usb_serial_state.binary) {
        int class_id = JS_GetClassID(ctx, argv[0].val);

        if (class_id == JS_CLASS_BYTE_SPAN_SOURCE ||
            class_id == JS_CLASS_BITMAP_SPAN_SOURCE) {
            state->source_kind = USB_SERIAL_FUTURE_SPANS;
            if (!esp32_mquickjs_open_byte_span_source(
                    ctx, argv[0].val, "usbSerial.send(data)",
                    &state->span_source, &error)) {
                usb_serial_future_release(state);
                return false;
            }
            state->span_source_opened = true;
        } else if (class_id == JS_CLASS_BYTE_VIEW) {
            JSValue *value = JS_AddGCRef(ctx, &state->value_ref);

            *value = argv[0].val;
            state->value_retained = true;
            if (!esp32_mquickjs_byte_view_acquire_read(
                    ctx, state->value_ref.val, "usbSerial.send(data)",
                    &state->data, &state->length)) {
                usb_serial_future_release(state);
                return false;
            }
            state->byte_view_leased = true;
            state->logical_length = state->length;
        } else {
            esp32_mquickjs_byte_source_t source;

            if (!esp32_mquickjs_get_byte_source(
                    ctx, argv[0].val, "usbSerial.send(data)",
                    &source, &state->owned, &error)) {
                usb_serial_future_release(state);
                return false;
            }
            state->data = source.data;
            state->length = source.length;
            state->logical_length = source.length;
        }
    } else {
        JSCStringBuf text_buf;
        const char *text;
        size_t text_length = 0;

        if (!JS_IsString(ctx, argv[0].val)) {
            usb_serial_future_release(state);
            JS_ThrowTypeError(
                ctx,
                "usbSerial.send(text) expects a string in text mode");
            return false;
        }
        text = JS_ToCStringLen(ctx, &text_length, argv[0].val, &text_buf);
        if (text == NULL) {
            usb_serial_future_release(state);
            return false;
        }
        if (text_length > s_usb_serial_state.max_frame_bytes) {
            usb_serial_future_release(state);
            JS_ThrowRangeError(ctx, "usbSerial.send() frame is too large");
            return false;
        }
        if (memchr(text, '\n', text_length) != NULL ||
            memchr(text, '\r', text_length) != NULL) {
            usb_serial_future_release(state);
            JS_ThrowTypeError(
                ctx,
                "usbSerial.send() text must contain exactly one line");
            return false;
        }
        state->owned = esp32_mquickjs_memory_payload_alloc(
            "usb-serial.write", text_length + 1U,
            ESP32_MQUICKJS_MEMORY_EXTERNAL);
        if (state->owned == NULL) {
            usb_serial_future_release(state);
            JS_ThrowOutOfMemory(ctx);
            return false;
        }
        memcpy(state->owned, text, text_length);
        state->owned[text_length] = '\n';
        state->data = state->owned;
        state->length = text_length + 1U;
        state->logical_length = text_length;
    }
    *out_state = state;
    return true;
}

static void usb_serial_future_timeout_wake(void *opaque)
{
    esp32_mquickjs_future_driver_state_t *state = opaque;

    if (state != NULL && state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
}

static void usb_serial_future_stop_timeout_wake(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state != NULL) {
        esp32_mquickjs_timer_resource_ops_t timer_ops =
            usb_serial_future_progress_timer_ops(state);

        esp32_mquickjs_timer_resource_stop(&state->progress_timer,
                                           &timer_ops);
    }
}

static bool usb_serial_future_arm_timeout_wake(
    esp32_mquickjs_future_driver_state_t *state,
    uint64_t now_us)
{
    esp32_mquickjs_timer_resource_ops_t timer_ops;
    uint64_t remaining_us;

    if (state == NULL || state->progress_timer.timer == NULL ||
        now_us >= state->progress_deadline_us) {
        return false;
    }
    remaining_us = state->progress_deadline_us - now_us;
    timer_ops = usb_serial_future_progress_timer_ops(state);
    esp32_mquickjs_timer_resource_stop(&state->progress_timer, &timer_ops);
    state->progress_timer_delay_us = remaining_us;
    return esp32_mquickjs_timer_resource_start(&state->progress_timer,
                                               &timer_ops) == ESP_OK;
}

static bool usb_serial_future_start(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token,
    esp32_mquickjs_future_driver_state_t *state)
{
    esp32_mquickjs_timer_resource_ops_t timer_ops;
    esp_err_t timer_err;

