99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/usb_serial/esp32_mquickjs_usb_serial.c
    if (state == NULL || s_usb_serial_state.sending) {
        JS_ThrowInternalError(
            ctx,
            "usbSerial.send() failed because another send is active");
        return false;
    }
    if (!s_usb_serial_state.opened ||
        state->generation != s_usb_serial_state.generation ||
        !usb_serial_jtag_is_connected()) {
        JS_ThrowReferenceError(
            ctx,
            "usbSerial.send() failed because USB Serial/JTAG is not connected");
        return false;
    }
    state->runtime = runtime;
    state->token = token;
    state->progress_deadline_us =
        (uint64_t)esp_timer_get_time() +
        (uint64_t)USB_SERIAL_BINARY_WRITE_STALL_TIMEOUT_MS * 1000ULL;
    timer_ops = usb_serial_future_progress_timer_ops(state);
    timer_err = esp32_mquickjs_timer_resource_acquire(
        &state->progress_timer, &timer_ops);
    if (timer_err != ESP_OK) {
        JS_ThrowInternalError(
            ctx, "usbSerial.send() failed to create the TX stall timer");
        return false;
    }
    if (!esp32_mquickjs_usb_serial_future_lifecycle_start(
            &state->lifecycle)) {
        JS_ThrowInternalError(
            ctx, "usbSerial.send() failed to acquire its lifecycle");
        return false;
    }
    s_usb_serial_state.sending = true;
    flockfile(stdout);
    esp32_mquickjs_usb_serial_future_lifecycle_lock_stdout(
        &state->lifecycle);
    (void)esp32_mquickjs_future_wake(runtime, token);
    return true;
}

static void usb_serial_future_step(
    esp32_mquickjs_future_driver_state_t *state)
{
    size_t budget = USB_SERIAL_BINARY_WRITE_CHUNK_BYTES * 4U;

    if (state == NULL ||
        esp32_mquickjs_usb_serial_future_lifecycle_ready(
            &state->lifecycle)) {
        return;
    }
    if (!s_usb_serial_state.initialized || !s_usb_serial_state.opened) {
        state->result = USB_SERIAL_WRITE_CLOSED;
        esp32_mquickjs_usb_serial_future_lifecycle_complete(
            &state->lifecycle);
        return;
    }
    if (!usb_serial_jtag_is_connected()) {
        state->result = USB_SERIAL_WRITE_DISCONNECTED;
        esp32_mquickjs_usb_serial_future_lifecycle_complete(
            &state->lifecycle);
        return;
    }

    while (budget > 0) {
        const uint8_t *data;
        size_t remaining;
        size_t chunk;
        int written;

        if (state->source_kind == USB_SERIAL_FUTURE_SPANS &&
            state->offset >= state->span.length) {
            esp32_mquickjs_byte_span_clear(&state->span);
            if (!esp32_mquickjs_byte_span_source_next(
                    state->ctx, &state->span_source, &state->span)) {
                if (JS_HasException(state->ctx)) {
                    state->source_failed = true;
                }
                esp32_mquickjs_usb_serial_future_lifecycle_complete(
                    &state->lifecycle);
                return;
            }
            state->offset = 0;
            if (state->span.length == 0) {
                continue;
            }
            if (state->span.data == NULL) {
                JS_ThrowInternalError(
                    state->ctx,
                    "usbSerial.send(data) received a non-empty span with null data");
                state->source_failed = true;
                esp32_mquickjs_usb_serial_future_lifecycle_complete(
                    &state->lifecycle);
                return;
            }
        }

        if (state->source_kind == USB_SERIAL_FUTURE_SPANS) {
            data = state->span.data;
            remaining = state->span.length - state->offset;
        } else {
            if (state->offset >= state->length) {
                esp32_mquickjs_usb_serial_future_lifecycle_complete(
                    &state->lifecycle);
                return;
            }
            data = state->data;
            remaining = state->length - state->offset;
        }
        chunk = remaining;
        if (chunk > USB_SERIAL_BINARY_WRITE_CHUNK_BYTES) {
            chunk = USB_SERIAL_BINARY_WRITE_CHUNK_BYTES;
        }
        if (chunk > budget) {
            chunk = budget;
        }
        written = usb_serial_jtag_write_bytes(data + state->offset,
                                              chunk, 0);
        if (written < 0) {
            state->result = USB_SERIAL_WRITE_INTERRUPTED;
            esp32_mquickjs_usb_serial_future_lifecycle_complete(
                &state->lifecycle);
            return;
        }
        if (written == 0) {
            uint64_t now_us = (uint64_t)esp_timer_get_time();

            if (now_us >= state->progress_deadline_us) {
                state->result = USB_SERIAL_WRITE_TIMEOUT;
                esp32_mquickjs_usb_serial_future_lifecycle_complete(
                    &state->lifecycle);
            } else if (!usb_serial_future_arm_timeout_wake(state, now_us)) {
                state->result = USB_SERIAL_WRITE_INTERRUPTED;
                esp32_mquickjs_usb_serial_future_lifecycle_complete(
                    &state->lifecycle);
            }
            return;
        }
        usb_serial_future_stop_timeout_wake(state);
        state->offset += (size_t)written;
        state->bytes_sent += (size_t)written;
        if (state->source_kind == USB_SERIAL_FUTURE_SPANS) {
            state->logical_length += (size_t)written;
        }
        state->progress_deadline_us =
            (uint64_t)esp_timer_get_time() +
            (uint64_t)USB_SERIAL_BINARY_WRITE_STALL_TIMEOUT_MS * 1000ULL;
        budget -= (size_t)written;
    }
    (void)esp32_mquickjs_future_wake(state->runtime, state->token);
}

static esp32_mquickjs_future_poll_t usb_serial_future_poll(
    esp32_mquickjs_future_driver_state_t *state)
{
    usb_serial_future_step(state);
    return state != NULL &&
                   esp32_mquickjs_usb_serial_future_lifecycle_ready(
                       &state->lifecycle)
               ? ESP32_MQUICKJS_FUTURE_READY
               : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue usb_serial_future_finish(
    JSContext *ctx,
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL ||
        esp32_mquickjs_usb_serial_future_lifecycle_cancelled(
            &state->lifecycle)) {
        return JS_ThrowInternalError(ctx, "usbSerial.send() was cancelled");
    }
    if (state->source_failed || JS_HasException(ctx)) {
        return JS_EXCEPTION;
    }
    if (state->result != USB_SERIAL_WRITE_OK) {
        return usb_serial_write_error(ctx, state->result);
    }
    s_usb_serial_state.sent_frames++;
    return JS_NewInt64(ctx, (int64_t)state->logical_length);
}

