99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/usb_serial/esp32_mquickjs_usb_serial.c
static esp32_mquickjs_cancel_result_t usb_serial_future_cancel(
    esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL ||
        !esp32_mquickjs_usb_serial_future_lifecycle_cancel(
            &state->lifecycle)) {
        return ESP32_MQUICKJS_CANCEL_REJECTED;
    }
    if (state->runtime != NULL) {
        (void)esp32_mquickjs_future_wake(state->runtime, state->token);
    }
    return ESP32_MQUICKJS_CANCELLED;
}

static void usb_serial_future_destroy(
    esp32_mquickjs_future_driver_state_t *state)
{
    uint32_t release =
        esp32_mquickjs_usb_serial_future_lifecycle_take_release(
            state != NULL ? &state->lifecycle : NULL);

    if ((release & ESP32_MQUICKJS_USB_SERIAL_RELEASE_STDOUT) != 0) {
        funlockfile(stdout);
    }
    if ((release & ESP32_MQUICKJS_USB_SERIAL_RELEASE_SEND_LANE) != 0) {
        s_usb_serial_state.sending = false;
    }
    usb_serial_future_release(state);
}

static esp32_mquickjs_resource_key_t usb_serial_future_resource_key(
    const esp32_mquickjs_future_driver_state_t *state)
{
    return state != NULL
               ? (esp32_mquickjs_resource_key_t)&s_usb_serial_state
               : NULL;
}

static const esp32_mquickjs_future_driver_t s_usb_serial_send_driver = {
    .capture = usb_serial_future_prepare,
    .start = usb_serial_future_start,
    .poll = usb_serial_future_poll,
    .finish = usb_serial_future_finish,
    .cancel = usb_serial_future_cancel,
    .destroy = usb_serial_future_destroy,
    .resource_key = usb_serial_future_resource_key,
};

static bool usb_serial_register_future_driver(
    JSContext *ctx,
    esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef global_ref;
    JSGCRef handle_ref;
    JSGCRef send_ref;
    JSGCRef receive_ref;
    JSValue *global = JS_PushGCRef(ctx, &global_ref);
    JSValue *handle = JS_PushGCRef(ctx, &handle_ref);
    JSValue *send = JS_PushGCRef(ctx, &send_ref);
    JSValue *receive = JS_PushGCRef(ctx, &receive_ref);
    bool registered;

    *global = JS_GetGlobalObject(ctx);
    *handle = JS_IsException(*global)
                  ? JS_EXCEPTION
                  : JS_NewObjectClassUser(ctx, JS_CLASS_USB_SERIAL_HANDLE);
    *send = JS_IsException(*handle)
                ? JS_EXCEPTION
                : JS_GetPropertyStr(ctx, *handle, "send");
    *receive = JS_IsException(*handle)
                   ? JS_EXCEPTION
                   : JS_GetPropertyStr(ctx, *handle, "receive");
    registered = !JS_IsException(*send) &&
                 esp32_mquickjs_future_register_driver(
                     ctx, runtime, *send, &s_usb_serial_send_driver) &&
                 !JS_IsException(*receive) &&
                 esp32_mquickjs_event_queue_register_receive_alias(
                     ctx, runtime, *receive);
    if (!registered && !JS_HasException(ctx)) {
        JS_ThrowInternalError(
            ctx, "failed to register USB Serial Future driver");
    }
    JS_PopGCRef(ctx, &receive_ref);
    JS_PopGCRef(ctx, &send_ref);
    JS_PopGCRef(ctx, &handle_ref);
    JS_PopGCRef(ctx, &global_ref);
    return registered;
}

JSValue js_usb_serial_status(JSContext *ctx,
                             JSValue *this_val,
                             int argc,
                             JSValue *argv)
{
    JSGCRef status_ref;
    JSValue *status;

    if (this_val == NULL || argc != 0 ||
        usb_serial_ref_from_value(ctx, *this_val, true) == NULL) {
        if (JS_HasException(ctx)) return JS_EXCEPTION;
        return JS_ThrowTypeError(
            ctx, "USBSerialHandle.status() expects no arguments");
    }
    (void)argv;
    status = JS_PushGCRef(ctx, &status_ref);
    *status = JS_NewObject(ctx);
    if (JS_IsException(*status) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "open",
                                         JS_NewBool(s_usb_serial_state.opened)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "connected",
                                         JS_NewBool(usb_serial_jtag_is_connected())) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "mode",
                                         JS_NewString(ctx,
                                             s_usb_serial_state.binary ? "binary" : "text")) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "maxFrameBytes",
                                         JS_NewInt32(ctx, (int32_t)s_usb_serial_state.max_frame_bytes)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "receivedFrames",
                                         JS_NewInt32(ctx, (int32_t)s_usb_serial_state.received_frames)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "sentFrames",
                                         JS_NewInt32(ctx, (int32_t)s_usb_serial_state.sent_frames)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "overflowFrames",
                                         JS_NewInt32(ctx, (int32_t)s_usb_serial_state.overflow_frames)) ||
        !esp32_mquickjs_set_property_ref(ctx, status, "droppedFrames",
                                         JS_NewUint32(ctx,
                                             esp32_mquickjs_event_queue_dropped(
                                                 s_usb_serial_state.event_queue)))) {
        JS_PopGCRef(ctx, &status_ref);
        return JS_EXCEPTION;
    }
    return JS_PopGCRef(ctx, &status_ref);
}

#endif
